app/views/posts/new.html.erb

SELECT "cities".* FROM "cities"
---
						<label>Ville de l'evenement</label>
						<%= select("post", "city_id", City.all.collect {|p| [p.ville, p.id] }) %>