app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"
---
	def index
		@posts = Post.all
		@test = Post.all.count