app/controllers/posts_controller.rb

    def create
        Post.create(permit_params)

        @list = params["list"]

        @list.each do |cle, val|
            if val == "yes"
                Post.last.genres << Genre.where(list: cle)
---
INSERT INTO "posts" ("title", "address", "date_limite", "hour", "description", "price", "image", "user_id", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "genres".* FROM "genres" WHERE "genres"."list" = $1  [["list", "cabaret"]]